---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralConnectionSettings
source: html/2801ae3b-491d-9e3e-23da-2ed82eeb0d13.htm
---
# StructuralConnectionSettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.